app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `offers`
SELECT COUNT(*) AS `numrows` FROM `contactus`
---
    public function homeAdmin()
    {
        $session = session();
        if (empty($_SESSION['admin'])) {
            return redirect()->to('/adm')->with('error', 'You can login here !');
        }

        $userMod = new User();
        $rh = new Rh();
        $offer = new Offer();
        $conta = new ContactUs();
        helper(['form', 'url']);
        $userInfo['userMod'] = $userMod->countAll();
        $userInfo['rh'] = $rh->countAll();
        $userInfo['offer'] = $offer->countAll();
        $userInfo['conta'] = $conta->countAll();